Revit 2027 API
Space.AverageEstimatedIllumination Property
Get the Average Estimated Illumination of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AverageEstimatedIllumination { get; }
Public ReadOnly Property AverageEstimatedIllumination As Double
	Get
public:
property double AverageEstimatedIllumination {
	double get ();
}
member AverageEstimatedIllumination : float with get
Property Value
Double
Remarks
This property is used to get the Average Estimated Illumination of the Space. (Unit: fc)
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace